stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/app_ble.c
          /* USER CODE END ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE*/
        }
        break;
      case ACI_GAP_PASSKEY_REQ_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GAP_PASSKEY_REQ_VSEVT_CODE\n");

          ret = aci_gap_passkey_resp(bleAppContext.BleApplicationContext_legacy.connectionHandle, CFG_FIXED_PIN);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_passkey_resp : Fail, reason: 0x%02X\n", ret);
          }
          else
          {
            APP_DBG_MSG("==>> aci_gap_passkey_resp : Success\n");
          }
          /* USER CODE BEGIN ACI_GAP_PASSKEY_REQ_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_PASSKEY_REQ_VSEVT_CODE*/
        }
        break;
      case ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE:
        {
          uint8_t confirm_value;
          APP_DBG_MSG(">>== ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE\n");
          APP_DBG_MSG("     - numeric_value = %d\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);
          APP_DBG_MSG("     - Hex_value = %x\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);

          /* Set confirm value to 1(YES) */
          confirm_value = 1;
          /* USER CODE BEGIN ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE_0*/
          
          /* USER CODE END ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE_0*/

          ret = aci_gap_numeric_comparison_value_confirm_yesno(bleAppContext.BleApplicationContext_legacy.connectionHandle, confirm_value);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_numeric_comparison_value_confirm_yesno : Fail, reason: 0x%02X\n", ret);
          }
          else
          {
            APP_DBG_MSG("==>> aci_gap_numeric_comparison_value_confirm_yesno : Success\n");
          }
          /* USER CODE BEGIN ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE*/
          
          /* USER CODE END ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE*/
        }
        break;
      case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE\n");
          aci_gap_pairing_complete_event_rp0 *p_pairing_complete;
          p_pairing_complete = (aci_gap_pairing_complete_event_rp0*)p_blecore_evt->data;

          if (p_pairing_complete->Status != 0)
          {
            APP_DBG_MSG("     - Pairing KO\n     - Status: 0x%02X\n     - Reason: 0x%02X\n",
                        p_pairing_complete->Status, p_pairing_complete->Reason);
          }
          else
          {
            APP_DBG_MSG("     - Pairing Success\n");
          }
          APP_DBG_MSG("\n");

          /* USER CODE BEGIN ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/
          
          /* If the AP establish a bond with an ESL and ESL is on Configuring state,
             the AP can configure ESL by writing some ESL Service characteristics  */
          if (p_pairing_complete->Status == SM_PAIRING_SUCCESS)
          { 
            ESL_AP_ESLConnected(bleAppContext.BleApplicationContext_legacy.connectionHandle, bleAppContext.deviceServerBdAddrType, bleAppContext.a_deviceServerBdAddr);
          }
          else if (p_pairing_complete->Status == SM_ENCRYPTION_FAILED_MISSING_PEER_LTK)
          {
            esl_info_t esl_info;
            NVMDB_HandleType esl_db_h;
            NVMDB_status_t status;
            
            APP_DBG_MSG("Pairing failed for key missing on peer device\n");
            
            status = ESL_AP_GetESLInfoByBDAddress(bleAppContext.deviceServerBdAddrType, bleAppContext.a_deviceServerBdAddr, &esl_info, &esl_db_h);
            if(status == 0)
            {
              /* ESL is configured. Remove from list. */
              APP_DBG_MSG("Remove device from NVM list\n");
              NVMDB_DeleteRecord(&esl_db_h);
            } 
            if(status ==0 || status == 1)
            {
              APP_DBG_MSG("Remove bond\n");
              aci_gap_remove_bonded_device(bleAppContext.deviceServerBdAddrType, bleAppContext.a_deviceServerBdAddr); //TODO: check if address is not an identity address
            }
          }
          
          if (p_pairing_complete->Status != SM_PAIRING_SUCCESS)
          {
            aci_gap_terminate(bleAppContext.BleApplicationContext_legacy.connectionHandle, BLE_ERROR_TERMINATED_REMOTE_USER);
          }
          
          /* USER CODE END ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/
        }
        break;
      case ACI_GATT_SRV_READ_VSEVT_CODE :
        {
          APP_DBG_MSG(">>== ACI_GATT_SRV_READ_VSEVT_CODE\n");

          aci_gatt_srv_read_event_rp0    *p_read;
          p_read = (aci_gatt_srv_read_event_rp0*)p_blecore_evt->data;
          uint8_t error_code = BLE_ATT_ERR_INSUFF_AUTHORIZATION;

          APP_DBG_MSG("Handle 0x%04X\n",  p_read->Attribute_Handle);

          /* USER CODE BEGIN ACI_GATT_SRV_READ_VSEVT_CODE_1*/

          /* USER CODE END ACI_GATT_SRV_READ_VSEVT_CODE_1*/

          aci_gatt_srv_resp(p_read->Connection_Handle,
                            p_read->CID,
                            p_read->Attribute_Handle,
                            error_code,
                            0,
                            NULL);

          /* USER CODE BEGIN ACI_GATT_SRV_READ_VSEVT_CODE_2*/

          /* USER CODE END ACI_GATT_SRV_READ_VSEVT_CODE_2*/
          break;
        }
        /* USER CODE BEGIN EVT_VENDOR_1 */
      case ACI_L2CAP_COS_CONNECTION_RESP_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_L2CAP_COS_CONNECTION_RESP_VSEVT_CODE\n");
          aci_l2cap_cos_connection_resp_event_rp0 *p_event;
          p_event = (aci_l2cap_cos_connection_resp_event_rp0 *) p_blecore_evt->data;
          
          APP_DBG_MSG("Channel_Type: %d\nPeer_MTU: %d\nPeer_MPS: %d\nCID_Count: %d\n", p_event->Channel_Type, 
                      p_event->Peer_MTU, 
                      p_event->Peer_MPS,
                      p_event->CID_Count);
          
          OTP_CLIENT_L2CAPConnectionResp(p_event);
        }
        break;
      case ACI_L2CAP_COS_SDU_DATA_TX_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_L2CAP_COS_SDU_DATA_TX_VSEVT_CODE\n");
          OTP_CLIENT_L2CAPTxComplete();
        }
        break;
      case ACI_L2CAP_COS_DISCONNECTION_COMPLETE_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_L2CAP_COS_DISCONNECTION_COMPLETE_VSEVT_CODE\n");
          OTP_CLIENT_L2CAPDisconnectionComplete();
        }
        break;
      case ACI_L2CAP_COMMAND_REJECT_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_L2CAP_COMMAND_REJECT_VSEVT_CODE\n");
          aci_l2cap_command_reject_event_rp0 *p_event;
          p_event = (aci_l2cap_command_reject_event_rp0 *) p_blecore_evt->data;
          
          APP_DBG_MSG("Reason: 0x%04X\n", p_event->Reason);
          if(p_event->Data_Length > 0)
          {
            APP_DBG_MSG("Reason Data:");
            for(int i = 0;  i < p_event->Data_Length; i++)
            {
              APP_DBG_MSG("%02X ", p_event->Data[i]);
            }
            APP_DBG_MSG("\n");
          }          
        }
        break;
      case ACI_HAL_FW_ERROR_VSEVT_CODE: 
        {
          aci_hal_fw_error_event_rp0 *event;
          event = (aci_hal_fw_error_event_rp0 *)p_blecore_evt->data;
          
          APP_DBG_MSG("ACI_HAL_FW_ERROR_VSEVT 0x%02X\n", event->FW_Error_Type);
          NVIC_SystemReset();
        }
        break;
        
      /* Opcode captured by client handler */
      case ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE:
      case ACI_ATT_CLT_FIND_INFO_RESP_VSEVT_CODE:
      case ACI_ATT_CLT_READ_RESP_VSEVT_CODE:
      case ACI_GATT_CLT_PROC_COMPLETE_VSEVT_CODE:
        
        break;
        
        /* USER CODE END EVT_VENDOR_1 */
      default:
        /* USER CODE BEGIN EVT_VENDOR_DEFAULT */
        APP_DBG_MSG("HCI_VENDOR_EVT: 0x%04X\n", p_blecore_evt->ecode);
        /* USER CODE END EVT_VENDOR_DEFAULT */
        break;
      }
    } /* HCI_VENDOR_EVT_CODE */
    break;

  case HCI_HARDWARE_ERROR_EVT_CODE:
    {
      hci_hardware_error_event_rp0 *p_hci_hardware_error_event;
      p_hci_hardware_error_event = (hci_hardware_error_event_rp0*)p_event_pckt->data;
      
