stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/app_ble.c
   }
}

void create_periodic_advertising_connection(uint8_t subevent, uint8_t Peer_Address_Type, uint8_t Peer_Address[6])
{ 
    tBleStatus ble_status;
    APP_DBG_MSG("!!!!! create_periodic_advertising_connection \n Peer_Address @:%02x:%02x:%02x:%02x:%02x:%02x\n",
               Peer_Address[5],
               Peer_Address[4],
               Peer_Address[3],
               Peer_Address[2],
               Peer_Address[1],
               Peer_Address[0]);
    APP_DBG_MSG("      Connection Interval:   %d ms\n  - Supervision Timeout: %d ms\n",
                CONNECTION_INTERVAL_MS, 
                SUPERVISION_TIMEOUT_MS);

    aci_gap_terminate_proc(GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC);
    gap_cmd_resp_wait();
    bGeneralConn = false;
    
    ble_status = aci_gap_create_periodic_advertising_connection(0, 
                                                                subevent,
                                                                0x00,
                                                                CFG_BD_ADDRESS_TYPE,
                                                                Peer_Address_Type,
                                                                Peer_Address,
                                                                (CONNECTION_INTERVAL_MS*100)/125, (CONNECTION_INTERVAL_MS*100)/125,
                                                                0,
                                                                SUPERVISION_TIMEOUT_MS/10,
                                                                2, 
                                                                2);  
  if (ble_status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gap_create_periodic_advertising_connection - fail, result: 0x%02X\n", ble_status);
    return;
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_create_periodic_advertising_connection - Success\n");
  }    
  bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
}     

static uint8_t analyse_adv_report(uint8_t adv_data_size, uint8_t *p_adv_data,
                                  uint8_t address_type, uint8_t *p_address)
{
  uint8_t found_status = 0;
  uint16_t i = 0;
  uint8_t ad_length, ad_type;

  if (bGeneralConn)
  {
    esl_info_t esl_info;
    NVMDB_HandleType db_h;
    
    if(ESL_AP_GetESLInfoByBDAddress(address_type, p_address, &esl_info, &db_h) == 0)
    {
      /* Found associated ESL advertising. Connect. */
      APP_DBG_MSG("Configured ESL found: %02x:%02x:%02x:%02x:%02x:%02x\n",p_address[5],p_address[4],p_address[3],p_address[2],p_address[1],p_address[0]);
      ESL_AP_Reconnect(address_type, p_address);
    } 
  }  
  else
  {  
    while(i < adv_data_size)
    {
      ad_length = p_adv_data[i];
      ad_type = p_adv_data[i + 1];
      
      switch (ad_type)
      {

      case AD_TYPE_16_BIT_SERV_UUID_CMPLT_LIST:
      case AD_TYPE_16_BIT_SERV_UUID:        
        for(int j=i+2; j<i+ad_length; j++)
        {
          if ((p_adv_data[j] == 0x57) && (p_adv_data[j+1] == 0x18))
          {
            printf("+SCAN: %d,%02X%02X%02X%02X%02X%02X\n",
                        address_type,
                        p_address[5],
                        p_address[4],
                        p_address[3],
                        p_address[2],
                        p_address[1],
                        p_address[0]);
            found_status = 1;
            break;
          } 
        }  
        break;
      default:
        break;
      }/* end of switch*/
      
      i += ad_length + 1; /* increment the iterator to go on next element*/
      
      if (found_status != 0)
      {
        break;
      }
    }/* end of while*/
  }  
  return found_status;
}

static void Connect_Request(void)
{
  tBleStatus result;
  
  aci_gap_terminate_proc(GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC);
  
  bGeneralConn = false;
  
  result = aci_gap_set_scan_configuration(DUPLICATE_FILTER_ENABLED, HCI_SCAN_FILTER_BASIC_FILTERED, LE_1M_PHY_BIT, HCI_SCAN_TYPE_PASSIVE, SCAN_INT_MS(500), SCAN_WIN_MS(500));
  if (result != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gap_set_scan_configuration - fail, result: 0x%02X\n", result);
    return;
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_set_scan_configuration - Success\n");
  }
  
  APP_DBG_MSG("Create connection to ESL\n");
  result = aci_gap_set_connection_configuration(LE_1M_PHY_BIT,
                                              (CONNECTION_INTERVAL_MS*100)/125, (CONNECTION_INTERVAL_MS*100)/125,
                                              0u,
                                              SUPERVISION_TIMEOUT_MS/10,
                                              2, 2); 
  
  if (result == BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_set_connection_configuration Success, result: 0x%02x\n", result);
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_set_connection_configuration Failed, result: 0x%02x\n", result);
  }  
  result = aci_gap_create_connection(LE_1M_PHY_BIT,
                                     bleAppContext.deviceServerBdAddrType,
                                     &bleAppContext.a_deviceServerBdAddr[0]);    
  if (result == BLE_STATUS_SUCCESS)
  {
    bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
    APP_DBG_MSG("==>> GAP Create connection Success\n");
  }
  else
  {
    APP_DBG_MSG("==>> GAP Create connection Failed, result: 0x%02x\n", result);
  }
  return;
}

uint8_t  Scan_proc(void)
{ 
  uint8_t status;
  uint32_t paramA, paramB, paramC;
 
  paramA = SCAN_INT_MS(500);
  paramB = SCAN_WIN_MS(500);
  paramC = APP_BLE_SCANNING;
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    aci_gap_terminate_proc(GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC);
    bGeneralConn = false;
    
    status = aci_gap_set_scan_configuration(DUPLICATE_FILTER_ENABLED, 0x00, LE_1M_PHY_BIT, HCI_SCAN_TYPE_ACTIVE, paramA, paramB);
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("aci_gap_set_scan_configuration - fail, result: 0x%02X\n", status);
      return status;
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_set_scan_configuration - Success\n");
    }
    
    status = aci_gap_start_procedure (GAP_GENERAL_DISCOVERY_PROC,LE_1M_PHY_BIT,0,0);
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("aci_gap_start_procedure - fail, result: 0x%02X\n", status);
      return status;
    }
    else
    {
      bleAppContext.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
      APP_DBG_MSG("==>> aci_gap_start_procedure - Success\n");
    }
  }
  else
  {
    status = BLE_STATUS_FAILED;   //TBR??? Check if it is correct error return value
  }    
  return status;
}

void set_bleAppContext_address(uint8_t address_type, uint8_t p_address[6])
{
  bleAppContext.deviceServerBdAddrType = address_type;
  memcpy(bleAppContext.a_deviceServerBdAddr, p_address, BD_ADDR_SIZE);
}

uint8_t* get_bleAppContext_address(void)
{
  return(bleAppContext.a_deviceServerBdAddr);
}

/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{
  return;
}

void APPE_Button2Action(void)
{  
  return;
}

void APPE_Button3Action(void)
{
  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
